In [1]:
import pandas as pd
import numpy as np

In [2]:
srs = pd.Series([11.9, 36.0, 16.6, 21.8, 34.2], index = ['China', 'India', 'Usa', 'Brazil', 'UK'])
srs.name = "Growth Rate"
srs.index.name = "Country"
srs.value = "rate"
print(srs)

Country
China     11.9
India     36.0
Usa       16.6
Brazil    21.8
UK        34.2
Name: Growth Rate, dtype: float64

In [3]:
# Look that the ones who doesnt match is beacuse there is no index with that name in srs1
srs1 = pd.Series([11.9, 36.0, 16.6, 21.8, 34.2], index = ['China', 'India', 'Usa', 'Brazil', 'UK'])
srs2 = pd.Series([20.3, 11.9,36,16.1,21.8,34.2], index = ['Africa', 'China', 'India', 'Usa', 'Brazil', 'Germany'])
srs = srs1/srs2
srs.name = "Res"
srs.index.name = "Country"
print(srs)

Country
Africa          NaN
Brazil     1.000000
China      1.000000
Germany         NaN
India      1.000000
UK              NaN
Usa        1.031056
Name: Res, dtype: float64

In [4]:
pd.isnull(srs)

Country
Africa      True
Brazil     False
China      False
Germany     True
India      False
UK          True
Usa        False
Name: Res, dtype: bool

In [5]:
pd.notnull(srs)

Country
Africa     False
Brazil      True
China       True
Germany    False
India       True
UK         False
Usa         True
Name: Res, dtype: bool

In [6]:
#indexes that satisfies some conditions
print(srs[srs== 1.0])

Country
Brazil    1.0
China     1.0
India     1.0
Name: Res, dtype: float64

In [7]:
#indexes that satisfies some conditions
print(srs[srs!= 1.0])

Country
Africa          NaN
Germany         NaN
UK              NaN
Usa        1.031056
Name: Res, dtype: float64

In [8]:
df = pd.read_csv('cancer_stats.csv')
df

,Sex,Under 1,1-4,5-9,10-14,15-19,20-24,25-29,30-34,35-39,40-44
0,Males,82,305,199,197,322,537,910,1239,1610,2045
1,Females,73,249,171,183,297,554,1341,2219,3085,4457
2,Males,0,0,1,4,10,7,17,30,67,139
3,Females,0,1,0,5,8,8,12,29,53,81
4,Males,0,0,0,0,0,0,1,1,1,2
...,...,...,...,...,...,...,...,...,...,...,...
453,Females,1,0,0,1,1,1,2,2,0,0
454,Males,6,41,50,31,61,62,115,165,318,565
455,Females,8,24,37,32,40,43,104,227,443,705
456,Males,3,38,49,27,57,60,112,161,315,545
457,Females,7,22,36,30,38,41,96,221,436,693

In [9]:
print(df.head()) #Gives me the first five rows

       Sex  Under 1  1-4  5-9  10-14  15-19  20-24  25-29  30-34  35-39  40-44
0    Males       82  305  199    197    322    537    910   1239   1610   2045
1  Females       73  249  171    183    297    554   1341   2219   3085   4457
2    Males        0    0    1      4     10      7     17     30     67    139
3  Females        0    1    0      5      8      8     12     29     53     81
4    Males        0    0    0      0      0      0      1      1      1      2

In [10]:
df.tail() #Gives me the last five rows

,Sex,Under 1,1-4,5-9,10-14,15-19,20-24,25-29,30-34,35-39,40-44
453,Females,1,0,0,1,1,1,2,2,0,0
454,Males,6,41,50,31,61,62,115,165,318,565
455,Females,8,24,37,32,40,43,104,227,443,705
456,Males,3,38,49,27,57,60,112,161,315,545
457,Females,7,22,36,30,38,41,96,221,436,693

In [11]:
# Accesing columns
print(df.columns)

Index(['Sex', 'Under 1', '1-4', '5-9', '10-14', '15-19', '20-24', '25-29',
       '30-34', '35-39', '40-44'],
      dtype='object')

In [12]:
print(df['Sex'].head())

0      Males
1    Females
2      Males
3    Females
4      Males
Name: Sex, dtype: object

In [13]:
print("\nThe type of this column is: " + str(type(df['Sex'])) + "\n")

The type of this column is: <class 'pandas.core.series.Series'>

In [14]:
print("\nThe Last Column \n")
print(df['40-44'].head())
print("\nThe type of this column is: " + str(type(df['40-44'])) + "\n")

The Last Column

0    2045
1    4457
2     139
3      81
4       2
Name: 40-44, dtype: int64

The type of this column is: <class 'pandas.core.series.Series'>

In [15]:
new_df = pd.DataFrame(df, columns=['Sex', 'Under 1', '40-44'])
new_df.head()

       Sex  Under 1  40-44
0    Males       82   2045
1  Females       73   4457
2    Males        0    139
3  Females        0     81
4    Males        0      2

In [16]:
#Access rows
print(df.loc[0]) #1st row

Sex        Males
Under 1       82
1-4          305
5-9          199
10-14        197
15-19        322
20-24        537
25-29        910
30-34       1239
35-39       1610
40-44       2045
Name: 0, dtype: object

In [17]:
#Access rows
print(df.loc[1]) #2nd row

Sex        Females
Under 1         73
1-4            249
5-9            171
10-14          183
15-19          297
20-24          554
25-29         1341
30-34         2219
35-39         3085
40-44         4457
Name: 1, dtype: object

In [18]:
df

,Sex,Under 1,1-4,5-9,10-14,15-19,20-24,25-29,30-34,35-39,40-44
0,Males,82,305,199,197,322,537,910,1239,1610,2045
1,Females,73,249,171,183,297,554,1341,2219,3085,4457
2,Males,0,0,1,4,10,7,17,30,67,139
3,Females,0,1,0,5,8,8,12,29,53,81
4,Males,0,0,0,0,0,0,1,1,1,2
...,...,...,...,...,...,...,...,...,...,...,...
453,Females,1,0,0,1,1,1,2,2,0,0
454,Males,6,41,50,31,61,62,115,165,318,565
455,Females,8,24,37,32,40,43,104,227,443,705
456,Males,3,38,49,27,57,60,112,161,315,545
457,Females,7,22,36,30,38,41,96,221,436,693

In [19]:
# adding column
new_df = pd.DataFrame(df, columns= ['Sex', 'Under 1', '40-44', 'Disease']) #The last column is the new one
new_df

         Sex  Under 1  40-44  Disease
0      Males       82   2045      NaN
1    Females       73   4457      NaN
2      Males        0    139      NaN
3    Females        0     81      NaN
4      Males        0      2      NaN
..       ...      ...    ...      ...
453  Females        1      0      NaN
454    Males        6    565      NaN
455  Females        8    705      NaN
456    Males        3    545      NaN
457  Females        7    693      NaN

[458 rows x 4 columns]

In [20]:
new_df['Disease'] = 'Lypohomia'
new_df

         Sex  Under 1  40-44    Disease
0      Males       82   2045  Lypohomia
1    Females       73   4457  Lypohomia
2      Males        0    139  Lypohomia
3    Females        0     81  Lypohomia
4      Males        0      2  Lypohomia
..       ...      ...    ...        ...
453  Females        1      0  Lypohomia
454    Males        6    565  Lypohomia
455  Females        8    705  Lypohomia
456    Males        3    545  Lypohomia
457  Females        7    693  Lypohomia

[458 rows x 4 columns]

In [21]:
new_df2 = pd.DataFrame(df, columns= ['Sex', 'Under 1', '40-44', 'Random_id'])
new_df2['Random_id'] = np.arange(new_df2.shape[0])
new_df2.head(10)

       Sex  Under 1  40-44  Random_id
0    Males       82   2045          0
1  Females       73   4457          1
2    Males        0    139          2
3  Females        0     81          3
4    Males        0      2          4
5  Females        0      4          5
6    Males        0     12          6
7  Females        0      7          7
8    Males        0     32          8
9  Females        0     19          9

In [22]:
srs1 = pd.Series([1.9, 4.5, 16.2, 21.8, 34.2], index = ['china', 'india', 'usa', 'brazil', 'pak'])
srs1.name = "Growth rate"
srs1.index.name = "Country"
print(srs1, "\n")
srs2 = srs1.reindex(['china', 'india', 'usa', 'brazil', 'pak', 'eng'])
print(srs2, "\n")
# fill_value parameter fills every NaN value found ('eng') with 0 in thise case
srs3 = srs1.reindex(['china', 'india', 'malasya', 'usa', 'brazil', 'pak', 'eng'], fill_value = 0)
print(srs3, "\n")

Country
china      1.9
india      4.5
usa       16.2
brazil    21.8
pak       34.2
Name: Growth rate, dtype: float64

Country
china      1.9
india      4.5
usa       16.2
brazil    21.8
pak       34.2
eng        NaN
Name: Growth rate, dtype: float64

Country
china       1.9
india       4.5
malasya     0.0
usa        16.2
brazil     21.8
pak        34.2
eng         0.0
Name: Growth rate, dtype: float64

In [23]:
arr2d = np.arange(16).reshape(4,4)
df = pd.DataFrame(arr2d, index = ['r1', 'r2', 'r3', 'r4'], columns = ['c1', 'c2', 'c3', 'c4'])
print(df)

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [24]:
df2 = df.reindex(['r1', 'r2', 'r3', 'r4', 'r5'])
df2

      c1    c2    c3    c4
r1   0.0   1.0   2.0   3.0
r2   4.0   5.0   6.0   7.0
r3   8.0   9.0  10.0  11.0
r4  12.0  13.0  14.0  15.0
r5   NaN   NaN   NaN   NaN

In [25]:
#.ffill(axis = 0) fill last row (remaining NaN) with the last value from the row above
df2.ffill(axis=0)

      c1    c2    c3    c4
r1   0.0   1.0   2.0   3.0
r2   4.0   5.0   6.0   7.0
r3   8.0   9.0  10.0  11.0
r4  12.0  13.0  14.0  15.0
r5  12.0  13.0  14.0  15.0

In [26]:
df2 = df.reindex(columns=['c1', 'c2', 'c3', 'c4'])
df2

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [27]:
#fill forward fill series or df object for df the axis is passed as parameter to the function

In [28]:
srs1 = pd.Series([1.9, 4.5, 16.2, 21.8, 34.2], index = ['china', 'india', 'usa', 'brazil', 'pak'])
srs1.name = "Growth rate"
srs1.index.name = "Country"
print(srs1, "\n")
srs2 = srs1.reindex(['china', 'india', 'usa', 'brazil', 'pak', 'eng', 'spain'])
#.ffill() by default (with no parameters) pick the last value to fill all the remaining rows
print(srs2.ffill(), "\n")
srs3 = srs1.reindex(['china', 'india', 'malasya', 'usa', 'brazil', 'pak', 'eng'], fill_value = 0)
print(srs3, "\n")

Country
china      1.9
india      4.5
usa       16.2
brazil    21.8
pak       34.2
Name: Growth rate, dtype: float64

Country
china      1.9
india      4.5
usa       16.2
brazil    21.8
pak       34.2
eng       34.2
spain     34.2
Name: Growth rate, dtype: float64

Country
china       1.9
india       4.5
malasya     0.0
usa        16.2
brazil     21.8
pak        34.2
eng         0.0
Name: Growth rate, dtype: float64

In [29]:
srs = pd.Series(np.arange(0,6,1), index = ['in1', 'in2', 'in3', 'in4', 'in5', 'in6'])

In [30]:
srs

in1    0
in2    1
in3    2
in4    3
in5    4
in6    5
dtype: int64

In [31]:
srs[3] #Picks the 4th element

3

In [32]:
print(srs[['in1', 'in4']])

in1    0
in4    3
dtype: int64

In [33]:
srs[4:]

in5    4
in6    5
dtype: int64

In [34]:
srs[srs>3] #Gives me every a serie with every element with value > 2

in5    4
in6    5
dtype: int64

In [35]:
srs

in1    0
in2    1
in3    2
in4    3
in5    4
in6    5
dtype: int64

In [36]:
print(srs.drop('in3'))
srs = srs.drop('in3') #return the same serie without 'in3' row

in1    0
in2    1
in4    3
in5    4
in6    5
dtype: int64

In [37]:
srs

in1    0
in2    1
in4    3
in5    4
in6    5
dtype: int64

In [38]:
#Selection indf
df

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [39]:
df['c4']

r1     3
r2     7
r3    11
r4    15
Name: c4, dtype: int64

In [40]:
type(df['c4']) #Each column of a DataFrame is a Serie

pandas.core.series.Series

In [41]:
df[df['c4'] > 3] #Filters all the rows in which 'c4' value > 3

    c1  c2  c3  c4
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [42]:
r = df.drop('r2')
r

    c1  c2  c3  c4
r1   0   1   2   3
r3   8   9  10  11
r4  12  13  14  15

In [43]:
r.drop('c1', axis = 1) #To delete columns i must define the axis, to delete rows it's not necessary

    c2  c3  c4
r1   1   2   3
r3   9  10  11
r4  13  14  15

In [44]:
r

    c1  c2  c3  c4
r1   0   1   2   3
r3   8   9  10  11
r4  12  13  14  15

In [45]:
#numeric indexes
srs1 = pd.Series([1,2,3], index = ['3', '2', '1'])

In [46]:
srs1.sort_index()

1    3
2    2
3    1
dtype: int64

In [47]:
srs1

3    1
2    2
1    3
dtype: int64

In [48]:
sr2 = pd.Series([1,2,3], index = ['b', 'c', 'a'])
print(sr2.sort_index())

a    3
b    1
c    2
dtype: int64

In [49]:
sr23 = pd.Series(np.random.randn(5))

In [50]:
sr23

0   -1.889820
1    1.435039
2   -0.573840
3    0.955341
4    1.026971
dtype: float64

In [51]:
sr23.sort_values()

0   -1.889820
2   -0.573840
3    0.955341
4    1.026971
1    1.435039
dtype: float64

In [52]:
#Gives you a rank based on each value, index 4 is the biggest (5) because it has the biggest value (1.856274)
sr23.rank()

0    1.0
1    5.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [53]:
#dealing with missing values
null_val = np.nan
srs = pd.Series(['A', 'B', 'C', null_val])
srs.isnull()

0    False
1    False
2    False
3     True
dtype: bool

In [54]:
srs

0      A
1      B
2      C
3    NaN
dtype: object

In [55]:
srs.dropna() #drop NaN

0    A
1    B
2    C
dtype: object

In [56]:
srs[3] = 20 #Update the value of index 3 with 20, previously was Nan

In [57]:
srs

0     A
1     B
2     C
3    20
dtype: object

In [60]:
df = pd.DataFrame([
    ['A', 'B', 'C', 'D'], 
    [null_val, 'B', null_val, 'D'], 
    [null_val, 'B', 'C', null_val],
    [null_val, null_val, null_val, null_val]])

print("Original DataFrame: ")
print(df)
#Dropping Null values
print("\nThe dropna() method:")
print(df.dropna()) #Delete every row with 1 or more NaN values

print("\nThe dropna(how = all) mehtod: ")
print(df.dropna(how = 'all')) #Delete every row if it contains only NaN values (every element)

print("\nThe dropna(axis = 1) method: ")
print(df.dropna(axis = 1)) #Delete every column with 1 or more NaN values

print("\nThe dropna(tresh = n) mehtod: ")
print(df.dropna(thresh = 1))

Original DataFrame:
     0    1    2    3
0    A    B    C    D
1  NaN    B  NaN    D
2  NaN    B    C  NaN
3  NaN  NaN  NaN  NaN

The dropna() method:
   0  1  2  3
0  A  B  C  D

The dropna(how = all) mehtod:
     0  1    2    3
0    A  B    C    D
1  NaN  B  NaN    D
2  NaN  B    C  NaN

The dropna(axis = 1) method:
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

The dropna(tresh = n) mehtod:
     0  1    2    3
0    A  B    C    D
1  NaN  B  NaN    D
2  NaN  B    C  NaN

In [61]:
print("Original DataFrame: ")
print(df)
#Fill the Null values
print("\nThe filled DataFrame:")
print(df.fillna('M')) #Delete every row with 1 or more NaN values

Original DataFrame:
     0    1    2    3
0    A    B    C    D
1  NaN    B  NaN    D
2  NaN    B    C  NaN
3  NaN  NaN  NaN  NaN

The filled DataFrame:
   0  1  2  3
0  A  B  C  D
1  M  B  M  D
2  M  B  C  M
3  M  M  M  M

In [64]:
df = pd.DataFrame(np.arange(9).reshape(3,3), index = ['A', 'B', 'C'], columns=['A', 'B', 'C'])
print("The DataFrame")
print(df)

print("\nThe sum of each column: ")
print(df.sum(axis = 0))

print("\nThe sum of each Row: ")
print(df.sum(axis= 1))

The DataFrame
   A  B  C
A  0  1  2
B  3  4  5
C  6  7  8

The sum of each column:
A     9
B    12
C    15
dtype: int64

The sum of each Row:
A     3
B    12
C    21
dtype: int64